#ติดต่อฐานข้อมูลจาก https://remotemysql.com

## ติดตั้ง MySQL connector

In [0]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading https://files.pythonhosted.org/packages/28/04/e40098f3730e75bbe36a338926f566ea803550a34fb50535499f4fc4787a/mysql-connector-2.2.9.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 171kB/s
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py) ... done
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp36-cp36m-linux_x86_64.whl size=247949 sha256=7b07eb9f4cae22f14dc2dd200156197a1acf6ede37db31373eaa27027a56eb3c
  Stored in directory: /root/.cache/pip/wheels/8c/83/a1/f8b6d4bb1bd6208bbde1608bbfa7557504bed9eaf2ecf8c175
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

## สร้าง Connection ไปยัง MySQL database

In [0]:
import mysql.connector

connection = mysql.connector.connect(
    host='remotemysql.com',
    user='3TzFLANO01',
    passwd='BaKnPRUzfy'
)

print(connection)

<mysql.connector.connection.MySQLConnection object at 0x7fac6f1c0278>

### กรณีที่ connect ไม่ได้

In [0]:
import mysql.connector

connection = mysql.connector.connect(
    host='remotemysql.com',
    user='3TzFLANO02',
    passwd='BaKnPRUzfy'
)

print(connection)

ProgrammingError: ignored

## แสดงฐานข้อมูล (Database) ที่อยู่ในระบบ (System's Databases)

In [0]:
cursor = connection.cursor()
cursor.execute('show databases')

for x in cursor:
    print(x)

(bytearray(b'3TzFLANO01'),)
(bytearray(b'information_schema'),)

## เชื่อมต่อฐานข้อมูลที่ต้องการ
### ในกรณีนี้เชื่อมต่อฐานข้อมูลชื่อ **3TzFLANO01**

In [0]:
import mysql.connector

connection = mysql.connector.connect(
    host='remotemysql.com',
    user='3TzFLANO01',
    passwd='BaKnPRUzfy',
    database='3TzFLANO01'
)

cursor = connection.cursor()
cursor.execute('show tables')
show_table = cursor.fetchall()

print('Number of table: ', len(show_table))

for x in show_table:
  print(x)

Number of table:  1
(bytearray(b'Student'),)

## แสดงข้อมูลที่อยู่ในตาราง (Table)

In [0]:
cursor.execute('select * from Student')
show_data = cursor.fetchall()

for x in show_data:
    print(x)

('61011221111', 'olarik', 'surinta', 'm')
('6210012001', 'Kaveepoj', 'Bunluewong', 'm')

In [0]:
print(type(show_data))

<class 'list'>

## แสดงรายละเอียดของ database

### แสดงชื่อ Field ของ Table

In [0]:
cursor.column_names

('Std_id', 'Std_name', 'Std_surname', 'Std_gender')

### แสดงรายละเอียด

In [0]:
cursor.description

[('Std_id', 253, None, None, None, None, 0, 4097),
 ('Std_name', 253, None, None, None, None, 0, 4097),
 ('Std_surname', 253, None, None, None, None, 0, 4097),
 ('Std_gender', 253, None, None, None, None, 0, 4097)]

## แสดงข้อมูลแบบเรียงลำดับ

### แสดงข้อมูลตาม ASC (น้อยไปมาก)

In [0]:
cursor.execute('select * from Student order by std_name asc')
show_data = cursor.fetchall()

for x in show_data:
    print(x)

('6210012001', 'Kaveepoj', 'Bunluewong', 'm')
('61011221111', 'olarik', 'surinta', 'm')

### ### แสดงข้อมูลตาม DESC (มากไปน้อย)

In [0]:
cursor.execute('select * from Student order by std_id desc')
show_data = cursor.fetchall()

for x in show_data:
    print(x)

('6210012001', 'Kaveepoj', 'Bunluewong', 'm')
('61011221111', 'olarik', 'surinta', 'm')

## เพิ่มข้อมูลลงตาราง (Insert)

In [0]:
sql_insert = "INSERT INTO Student (Std_id, Std_name, Std_surname, Std_gender) \
              VALUES (%s, %s, %s, %s)"
val = ("620110120", "Suwich", "Tirakoat", "m")
cursor.execute(sql_insert, val)             

connection.commit()

print(cursor.rowcount, "record inserted.")

1 record inserted.

In [0]:
cursor.execute('select * from Student')
show_data = cursor.fetchall()

for x in show_data:
    print(x)

('61011221111', 'olarik', 'surinta', 'm')
('6210012001', 'Kaveepoj', 'Bunluewong', 'm')
('620110120', 'Suwich', 'Tirakoat', 'm')

### เพิ่มข้อมูลลงตารางแบบหลายชุด (Multiple Insert)

In [0]:
sql_insert = "INSERT INTO Student (Std_id, Std_name, Std_surname, Std_gender) \
              VALUES (%s, %s, %s, %s)"
val = [
       ("630110230", "Suwichai", "Punsa", "m"),
       ("630110230", "Angelina", "Jolie", "f"),
       ("630120430", "Jennifer", "Lawrence", "f")
       ]

for values in val:
  cursor.execute(sql_insert, values)

connection.commit()

In [0]:
cursor.execute('select * from Student')
show_data = cursor.fetchall()

for x in show_data:
    print(x)

('61011221111', 'olarik', 'surinta', 'm')
('6210012001', 'Kaveepoj', 'Bunluewong', 'm')
('620110120', 'Suwich', 'Tirakoat', 'm')
('630110230', 'Suwichai', 'Punsa', 'm')
('630110230', 'Angelina', 'Jolie', 'f')
('630120430', 'Jennifer', 'Lawrence', 'f')

## แสดงข้อมูลแบบ DataFrame ด้วย Pandas

แสดงประเภทข้อมูลของตัวแปรที่อ่านมาจาก MySQL

In [0]:
type(show_data)

list

### สร้าง DataFrame

In [0]:
import pandas as pd

df_std = pd.DataFrame(show_data, columns = cursor.column_names)

### แสดงข้อมูล DataFrame

In [0]:
df_std

        Std_id  Std_name Std_surname Std_gender
0  61011221111    olarik     surinta          m
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f

### จัดเรียงข้อมูลด้วย Pandas

In [0]:
df_std.sort_values(by='Std_id')

        Std_id  Std_name Std_surname Std_gender
0  61011221111    olarik     surinta          m
2    620110120    Suwich    Tirakoat          m
1   6210012001  Kaveepoj  Bunluewong          m
3    630110230  Suwichai       Punsa          m
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f

In [0]:
df_std.sort_values(by='Std_name')

        Std_id  Std_name Std_surname Std_gender
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
0  61011221111    olarik     surinta          m

In [0]:
df_std.sort_values(by='Std_name', ascending=False)

        Std_id  Std_name Std_surname Std_gender
0  61011221111    olarik     surinta          m
3    630110230  Suwichai       Punsa          m
2    620110120    Suwich    Tirakoat          m
1   6210012001  Kaveepoj  Bunluewong          m
5    630120430  Jennifer    Lawrence          f
4    630110230  Angelina       Jolie          f

In [0]:
df_std.sort_values(by='Std_name', ascending=True)

        Std_id  Std_name Std_surname Std_gender
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
0  61011221111    olarik     surinta          m

In [0]:
df_std.sort_values(by=['Std_name','Std_surname'])

        Std_id  Std_name Std_surname Std_gender
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
0  61011221111    olarik     surinta          m

In [0]:
df_std.sort_values(by=['Std_name','Std_surname'], ascending=True)

        Std_id  Std_name Std_surname Std_gender
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
0  61011221111    olarik     surinta          m

## สร้างฟังก์ชันเพื่อใช้งานฐานข้อมูล

In [0]:
import mysql.connector

#ฟังก์ชันการเชื่อมต่อ (connect) ฐานข้อมูล

def mysql_connect():
  try:
    connection = mysql.connector.connect(
        host='remotemysql.com',
        user='3TzFLANO01',
        passwd='BaKnPRUzfy'
    )
    print('Connected MySQL...')
    return connection
  except:
    print('Please check: host/user/passwd')


#ฟังก์ชันการแสดงรายชื่อฐานข้อมูล
def mysql_show_database(connection):
  cursor = connection.cursor()
  cursor.execute('show databases')
  print('No. of database', len(cursor.fetchall())-1)
  
  cursor.execute('show databases')   
  for x in cursor:
    print(x[0])
  
  return cursor

def mysql_connect_database(db_name):
  try:
    connection = mysql.connector.connect(
        host='remotemysql.com',
        user='3TzFLANO01',
        passwd='BaKnPRUzfy',
        database=db_name
    )
    print('Connected MySQL...')
    print('Used database:', db_name)
    return connection
  except:
    print('Please check: host/user/passwd')

### การเรียกใช้ฟังก์ชัน

In [0]:
# calling function
connection = mysql_connect()

Connected MySQL...

In [0]:
# เรียกใช้ฟังก์ชันเพื่อแสดงรายชื่อฐานข้อมูล
connection = mysql_connect()
cursor = mysql_show_database(connection)

Connected MySQL...
No. of database 1
bytearray(b'3TzFLANO01')
bytearray(b'information_schema')

แสดงข้อมูลของแต่ละ Table

In [0]:
connection = mysql_connect_database('3TzFLANO01')
mycursor = connection.cursor()
mycursor.execute('show tables')

for x in mycursor:
  print(x[0])

Connected MySQL...
Used database: 3TzFLANO01
bytearray(b'Student')

In [0]:
import pandas as pd

mycursor.execute('select * from Student')
show_data = mycursor.fetchall()

df_std = pd.DataFrame(show_data, columns = mycursor.column_names)
df_std

        Std_id  Std_name Std_surname Std_gender
0  61011221111    olarik     surinta          m
1   6210012001  Kaveepoj  Bunluewong          m
2    620110120    Suwich    Tirakoat          m
3    630110230  Suwichai       Punsa          m
4    630110230  Angelina       Jolie          f
5    630120430  Jennifer    Lawrence          f